1s/ERP/Conf/Catalogs/Лико_ФормулыПантонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ФормулыПантонов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечатиСтарый</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВСмеси</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ФормулыПантонов/Ext/ManagerModule.bsl
Функция СодатьНоменклатуруСмеси070222(Формула,ВидТМЦ,ВидПечати,БазоваяНоменклатура) Экспорт //+Лико m.shenderov 25.01.2021
	
	Если ТипЗнч(Формула)=Тип("Строка") Тогда
	НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
Иначе
	НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		Возврат Смесь;
	КонецЕсли;
	
	
	
	СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент();
	СпрОбъект.Лико_ВидТМЦ		                =ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                =ВидПечати;
	СпрОбъект.ВидНоменклатуры	                =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                =НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                =БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                =БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                =БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                =БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      =БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                =БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        =БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок						=БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.НаборУпаковок                     =БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            =БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         =БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     =Формула.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                   =Перечисления.ТипыНоменклатуры.Товар;		
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;	
	
	
КонецФункции  //-Лико m.shenderov 25.01.2021


Функция СодатьНоменклатуруСмеси(Формула, ВидТМЦ, ВидПечати, БЗ) Экспорт 

	Если ТипЗнч(Формула)=Тип("Строка") Тогда
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула);
	Иначе
		НаименованиеСмеси=СокрЛП(ВидТмц)+"_"+ СокрЛП(ВидПечати)+"_"+СокрЛП(Формула.Наименование);

	КонецЕсли;
	Смесь=Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСмеси);

	Если  ЗначениеЗаполнено(Смесь) Тогда
		СпрОбъект= Смесь.ПолучитьОбъект(); 
	Иначе
		СпрОбъект					                =Справочники.Номенклатура.СоздатьЭлемент(); 		
	КонецЕсли;
	



	
	
	ЗаполнитьЗначенияСвойств(СпрОбъект,БЗ.БазоваяНоменклатура,,"Ссылка");
	
	
	
	СпрОбъект.Лико_ВидТМЦ		                =ВидТМЦ;
	СпрОбъект.Лико_ВидПечати	                =ВидПечати;
	СпрОбъект.ВидНоменклатуры	                =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыКраска.ЗначениеПараметра;
	СпрОбъект.Наименование		                =НаименованиеСмеси;
	СпрОбъект.ЕдиницаИзмерения	                =БЗ.БазоваяНоменклатура.ЕдиницаИзмерения;
	СпрОбъект.ЕдиницаДляОтчетов	                =БЗ.БазоваяНоменклатура.ЕдиницаДляОтчетов;
	СпрОбъект.ВесЗнаменатель	                =БЗ.БазоваяНоменклатура.ВесЗнаменатель;
	СпрОбъект.ВесИспользовать	                =БЗ.БазоваяНоменклатура.ВесИспользовать;
	СпрОбъект.ВесМожноУказыватьВДокументах      =БЗ.БазоваяНоменклатура.ВесМожноУказыватьВДокументах;
	СпрОбъект.ГруппаДоступа		                =БЗ.БазоваяНоменклатура.ГруппаДоступа;
	СпрОбъект.ИспользоватьУпаковки		        =БЗ.БазоваяНоменклатура.ИспользоватьУпаковки;
	СпрОбъект.НаборУпаковок						=БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.НаборУпаковок                     =БЗ.БазоваяНоменклатура.НаборУпаковок;
	СпрОбъект.ГруппаФинансовогоУчета            =БЗ.БазоваяНоменклатура.ГруппаФинансовогоУчета;
	СпрОбъект.ГруппаАналитическогоУчета         =БЗ.БазоваяНоменклатура.ГруппаАналитическогоУчета;
	СпрОбъект.ЦеноваяГруппа                     =Формула.ЦеноваяГруппа;
	СпрОбъект.ТипНоменклатуры                   =Перечисления.ТипыНоменклатуры.Товар;
	СпрОбъект.Записать();
	
		МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",
	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("КраскаВид", Истина),
	УправлениеСвойствами.ЗначениеСвойства(БЗ,"КраскаВид")));
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(СпрОбъект.Ссылка,МассивСтруктур);


	Возврат СпрОбъект.Ссылка;	


КонецФункции


Функция ПроверкаЗаполненияПолей(Формула)Экспорт //+Лико m.shenderov 27.07.2021
	Поля="";
	Если  Не ЗначениеЗаполнено(Формула.Состав) Тогда
		Поля=Поля+"
		| Состав;";
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Формула.ВидПечати) Тогда
		Поля=Поля+"
		| Вид печати;";
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Формула.ВидТМЦ) Тогда
		Поля=Поля+"
		| Вид ТМЦ;";
	КонецЕсли;
	
	Если Формула.Площадка = Справочники.Лико_Площадки.ИксПак Тогда		
		Если  Не ЗначениеЗаполнено(Формула.ЦеноваяГруппа) Тогда
			Поля=Поля+"
			| Ценовая группа;";
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(Формула.Номенклатура) Тогда
			Поля=Поля+"
			| Номенклатура;";
		КонецЕсли;				
	КонецЕсли;
	Если ЗначениеЗаполнено(Поля) Тогда
		Поля=Лев(Поля,СтрДлина(Поля)-1)+".";
		Поля="В формуле не заполнены следующие реквизиты: "+Поля;
	КонецЕсли;
	
	Возврат Поля;

	
КонецФункции //-Лико m.shenderov 27.07.2021
